app/Controllers/Pregunta.php

SELECT *
FROM `preguntas`
WHERE `id` > '7'
ORDER BY `id` ASC
 LIMIT 1
SELECT *
FROM `preguntas`
ORDER BY `id` ASC
 LIMIT 1
---
    public function siguiente($id = null)
    {
        $model = new PreguntaModel();

        // Si se pasa un ID, trae la siguiente pregunta
        if ($id !== null) {
            $pregunta = $model->where('id >', $id)->orderBy('id', 'asc')->first();
        } else {
            // Primer pregunta si no hay ID
            $pregunta = $model->orderBy('id', 'asc')->first();